; ==================================================================================================
; Title:      OA_Tools_CN.lng
; Author:     G. Friedrich
; Version:    C.1.0
; Purpose:    ObjAsm OAT_App chinese language resource UCS-2 encoded file.
; Notes:      Version C.1.0, October 2017
;               - First release.
; ==================================================================================================


STRINGTABLE
LANGUAGE LANG_CHINESE, SUBLANG_CHINESE_SIMPLIFIED
BEGIN
  IDLANG_CHINESE + IDS_APPLICATION,             "申請|应用命令"
  IDLANG_CHINESE + IDS_APPL_SETUP,              "建立...~F2|应用设置对话框"
  IDLANG_CHINESE + IDS_LANGUAGE,                "应用设置对话框|语言选择"
  IDLANG_CHINESE + IDS_LANG_ENGLISH,            "&English|English language"
  IDLANG_CHINESE + IDS_LANG_GERMAN,             "&Deutsch|Deutsche Sprache"
  IDLANG_CHINESE + IDS_LANG_SPANISH,            "&Español|Lenguage español"
  IDLANG_CHINESE + IDS_LANG_CHINESE,            "中文|中文"
  IDLANG_CHINESE + IDS_APPL_EXIT,               "出口...~Alt+F4|退出应用程序"

  IDLANG_CHINESE + IDS_EDIT,                    "&编辑|编辑命令"
  IDLANG_CHINESE + IDS_EDIT_CUT,                XMENU_CAT_RES(切~Ctrl+X, IDS_HINT_CUT)
  IDLANG_CHINESE + IDS_EDIT_COPY,               XMENU_CAT_RES(复制~Ctrl+C, IDS_HINT_COPY)
  IDLANG_CHINESE + IDS_EDIT_PASTE,              XMENU_CAT_RES(糊~Ctrl+V, IDS_HINT_PASTE)
  IDLANG_CHINESE + IDS_EDIT_DELETE,             XMENU_CAT_RES(删~Del, IDS_HINT_DELETE)
  IDLANG_CHINESE + IDS_EDIT_SELECT_ALL,         XMENU_CAT_RES(全选~Ctrl+A, IDS_HINT_SELECT_ALL)

  IDLANG_CHINESE + IDS_OPEN_EDITOR,             XMENU_CAT_RES(打开外部编辑器, IDS_HINT_OPEN_EDITOR)
  IDLANG_CHINESE + IDS_COPY_FILENAME,           XMENU_CAT_RES(复制文件名, IDS_HINT_COPY_FILENAME)
  IDLANG_CHINESE + IDS_CHECK_AGAIN,             XMENU_CAT_RES(再检查一遍, IDS_HINT_CHECK_AGAIN)

  IDLANG_CHINESE + IDS_MENU_CHECK,              "检查|源代码检查"
  IDLANG_CHINESE + IDS_MENU_CHECK_MTD,          "Method"
  IDLANG_CHINESE + IDS_MENU_CHECK_MTD_REG,      "&Registers...|检查寄存器用法到方法中"
  IDLANG_CHINESE + IDS_MENU_CHECK_MTD_ARG,      "&Arguments...|检查参数用法到方法中"
  IDLANG_CHINESE + IDS_MENU_CHECK_MTD_LOC,      "&Locals...|将本地用法检查到方法中"
  IDLANG_CHINESE + IDS_MENU_CHECK_MTD_ALL,      "所有...~F5|执行所有方法检查"
  IDLANG_CHINESE + IDS_MENU_CHECK_PRC,          "Procedure"
  IDLANG_CHINESE + IDS_MENU_CHECK_PRC_REG,      "R&egisters...|检查程序中的寄存器使用情况"
  IDLANG_CHINESE + IDS_MENU_CHECK_PRC_ARG,      "Ar&guments...|检查过程参数的用法"
  IDLANG_CHINESE + IDS_MENU_CHECK_PRC_LOC,      "L&ocals...|检查过程本地的使用情况"
  IDLANG_CHINESE + IDS_MENU_CHECK_PRC_ALL,      "所有...~Ctrl+F5|执行所有程序检查"
  IDLANG_CHINESE + IDS_MENU_CHECK_MAC,          "Macro"
  IDLANG_CHINESE + IDS_MENU_CHECK_MAC_ARG,      "Arg&uments...|检查宏参数的用法"
  IDLANG_CHINESE + IDS_MENU_CHECK_MAC_LOC,      "Lo&cals...|检查宏本地的使用情况"
  IDLANG_CHINESE + IDS_MENU_CHECK_MAC_ALL,      "所有...~Alt+F5|执行所有宏检查"

  IDLANG_CHINESE + IDS_TOOL,                    "&工具|外部工具"

  IDLANG_CHINESE + IDS_WINDOW,                  "窗口|窗口命令"
  IDLANG_CHINESE + IDS_WINDOW_CASCADE,          XMENU_CAT_RES(级联~Shift+F5, IDS_HINT_CASCADE)
  IDLANG_CHINESE + IDS_WINDOW_TILE_HOR,         XMENU_CAT_RES(水平平铺, IDS_HINT_TILE_HOR)
  IDLANG_CHINESE + IDS_WINDOW_TILE_VER,         XMENU_CAT_RES(垂直平铺~Shift+F4, IDS_HINT_TILE_VER)
  IDLANG_CHINESE + IDS_WINDOW_ARRANGE,          XMENU_CAT_RES(安排图标, IDS_HINT_ARRANGE)
  IDLANG_CHINESE + IDS_WINDOW_NEXT,             XMENU_CAT_RES(下一个~Ctrl+F6, IDS_HINT_NEXT)
  IDLANG_CHINESE + IDS_WINDOW_PREV,             XMENU_CAT_RES(以前~Ctrl+Shift+F6, IDS_HINT_PREV)
  IDLANG_CHINESE + IDS_WINDOW_CLOSE,            XMENU_CAT_RES(关~Ctrl+F4, IDS_HINT_CLOSE)
  IDLANG_CHINESE + IDS_WINDOW_CLOSE_ALL,        XMENU_CAT_RES(关闭所有, IDS_HINT_CLOSE)

  IDLANG_CHINESE + IDS_HELP,                    "&救命|调用帮助"
  IDLANG_CHINESE + IDS_HELP_SYSINFO,            "系统信息...|启动系统信息"
  IDLANG_CHINESE + IDS_HELP_HELP,               "申请帮助...~F1|启动此应用程序的帮助系统"
  IDLANG_CHINESE + IDS_HELP_ABOUT,              "关于...~Shift+F1|显示有关此应用程序的信息"

  IDLANG_CHINESE + IDS_HINT_CUT,                "将选择剪切到剪贴板"
  IDLANG_CHINESE + IDS_HINT_COPY,               "将选择内容复制到剪贴板"
  IDLANG_CHINESE + IDS_HINT_PASTE,              "粘贴剪贴板内容"
  IDLANG_CHINESE + IDS_HINT_DELETE,             "删除选择"
  IDLANG_CHINESE + IDS_HINT_SELECT_ALL,         "选择整个内容"

  IDLANG_CHINESE + IDS_HINT_CASCADE,            "级联所有窗口"
  IDLANG_CHINESE + IDS_HINT_TILE_HOR,           "平铺所有窗户"
  IDLANG_CHINESE + IDS_HINT_TILE_VER,           "垂直平铺所有窗口"
  IDLANG_CHINESE + IDS_HINT_ARRANGE,            "安排所有窗口图标"
  IDLANG_CHINESE + IDS_HINT_NEXT,               "移动到下一个窗口"
  IDLANG_CHINESE + IDS_HINT_PREV,               "移至上一个窗口"
  IDLANG_CHINESE + IDS_HINT_CLOSE,              "关闭活动窗口"
  IDLANG_CHINESE + IDS_HINT_CLOSE_ALL,          "关闭所有窗户"

  IDLANG_CHINESE + IDS_HINT_OPEN_EDITOR,        "打开外部编辑器"
  IDLANG_CHINESE + IDS_HINT_COPY_FILENAME,      "将文件名复制到剪贴板"
  IDLANG_CHINESE + IDS_HINT_CHECK_AGAIN,        "再次检查文件"

  IDLANG_CHINESE + IDS_HINT_ZOOM_IN,            "放大"
  IDLANG_CHINESE + IDS_HINT_ZOOM_OUT,           "缩小"

  IDLANG_CHINESE + IDS_WORKING,                 "工作"
  IDLANG_CHINESE + IDS_CHECK_REG_READY,         "寄存器检查准备好了。"
  IDLANG_CHINESE + IDS_CHECK_LOC_READY,         "当地人检查准备好了。"
  IDLANG_CHINESE + IDS_CHECK_ARG_READY,         "参数检查准备好了。"
  IDLANG_CHINESE + IDS_FILE_EMPTY,              "这个文件是空的！"
  IDLANG_CHINESE + IDS_FILE_OPEN_ERROR,         "此文件无法打开！"

  IDLANG_CHINESE + IDS_SELECT_FILE,             "选择一个文件......"
  IDLANG_CHINESE + IDS_SELECT_EDITOR,           "选择外部编辑器......"
  IDLANG_CHINESE + IDS_SELECT_TOOL,             "选择一个工具......"
  IDLANG_CHINESE + IDS_INTERNAL_FAILURE,        "应用内部故障！"

  IDLANG_CHINESE + IDS_DLG_EXIT_CAPTION,        "ObjAsm Tools 出口"
  IDLANG_CHINESE + IDS_DLG_EXIT_QUESTION,       "你确定要离开？"
  IDLANG_CHINESE + IDS_DLG_EXIT_YES,            "是"
  IDLANG_CHINESE + IDS_DLG_EXIT_NO,             "没有"

  IDLANG_CHINESE + IDS_TAB1_MAIN,               "主要   "
  IDLANG_CHINESE + IDS_TAB1_APPLICATION,        "应用"
  IDLANG_CHINESE + IDS_TAB1_EXTERNAL_EDITOR,    "外部编辑:"
  IDLANG_CHINESE + IDS_TAB1_LINE_TERMINATOR,    "行终止符:"
  IDLANG_CHINESE + IDS_TAB1_WINDOW,             "窗口"
  IDLANG_CHINESE + IDS_TAB1_ZOOM_FACTOR,        "缩放系数:"
  IDLANG_CHINESE + IDS_TAB1_FONTFACE_NAME,      "字体名称:"
  IDLANG_CHINESE + IDS_TAB1_FONT_SIZE,          "字体大小:"
  IDLANG_CHINESE + IDS_TAB1_CHECKS,             "检查"
  IDLANG_CHINESE + IDS_TAB1_CLOSE_NO_FINDINGS,  "如果没有发现就关闭"
  IDLANG_CHINESE + IDS_TAB1_USE_ANNOTATIONS,    "使用注释"
  IDLANG_CHINESE + IDS_TAB1_MIXED,              "都"

  IDLANG_CHINESE + IDS_TAB2_TOOLS,              "工具   "
  IDLANG_CHINESE + IDS_TAB2_TOOL,               "工具"
  IDLANG_CHINESE + IDS_TAB2_NAME,               "名称"
  IDLANG_CHINESE + IDS_TAB2_COMMAND,            "命令"
  IDLANG_CHINESE + IDS_TAB2_NOTE,               "注意：在命令后附加'$'以将文件名作为参数传递。"

  IDLANG_CHINESE + IDS_TAB3_COLORS,             "颜色  "
  IDLANG_CHINESE + IDS_TAB3_COLOR_NOTIF,        "通知"
  IDLANG_CHINESE + IDS_TAB3_COLOR_COMMENT,      "信息"
  IDLANG_CHINESE + IDS_TAB3_COLOR_FAILIURE,     "失败"
  IDLANG_CHINESE + IDS_TAB3_COLOR_BKGROUND,     "背景"
  IDLANG_CHINESE + IDS_TAB3_COLOR_REG_ERROR,    "注册错误"
  IDLANG_CHINESE + IDS_TAB3_COLOR_REG_WARNING,  "注册警告"
  IDLANG_CHINESE + IDS_TAB3_COLOR_ARG_WARNING,  "争论警告"
  IDLANG_CHINESE + IDS_TAB3_COLOR_LOC_WARNING,  "本地警告"
  IDLANG_CHINESE + IDS_TAB3_NOTE,               "注意：更改将应用于新窗口。"

  IDLANG_CHINESE + IDS_SETUP,                   "建立"
  IDLANG_CHINESE + IDS_CANCEL,                  "取消"

  IDLANG_CHINESE + IDS_CODEBLOCK_NAME,          "  代码块: "
  IDLANG_CHINESE + IDS_REGISTERS,               "  寄存器:"
  IDLANG_CHINESE + IDS_ARGUMENTS,               "  争论:  "
  IDLANG_CHINESE + IDS_LOCALS,                  "  本地:  "
  IDLANG_CHINESE + IDS_REG_WARNING,             "警告：可能检测到不必要的寄存器保留。"
  IDLANG_CHINESE + IDS_ARG_WARNING,             "警告：可能检测到未使用的参数。"
  IDLANG_CHINESE + IDS_LOC_WARNING,             "警告：可能检测到未使用的局部变量。"
  IDLANG_CHINESE + IDS_REG_ERROR,               "错误：可能检测到未注册的寄存器。"

  IDLANG_CHINESE + IDS_SELECTION_FILE_NAME      "选定的文件名:"
  IDLANG_CHINESE + IDS_SELECTION_OPEN           "打开"
  IDLANG_CHINESE + IDS_SELECTION_FILTER_NAME_0  "汇编程序文件"
  IDLANG_CHINESE + IDS_SELECTION_FILTER_NAME_1  "文本文件"
  IDLANG_CHINESE + IDS_SELECTION_FILTER_NAME_2  "所有的文件"

  IDLANG_CHINESE + IDS_ABOUT_CAPTION,           "关于此应用程序"
  IDLANG_CHINESE + IDS_ABOUT_APPLICATION,       "ObjAsm Tools"
  IDLANG_CHINESE + IDS_ABOUT_VERSION,           "版本 "
  IDLANG_CHINESE + IDS_ABOUT_DESCRIPTION,       "此应用程序是一组检查汇编程序源代码的工具。\n请仔细阅读使用说明书。"
  IDLANG_CHINESE + IDS_ABOUT_EMAIL,             "ICON_LINK|访问我们的主页|http://objasm.x10host.com/"
  IDLANG_CHINESE + IDS_ABOUT_HOMEPAGE,          "ICON_MAIL|给我们发电子邮件|mailto:objasm@gmx.net"

  IDLANG_CHINESE + IDS_TOOL_FILTER_NAME_0,      "可执行文件"
  IDLANG_CHINESE + IDS_TOOL_FILTER_NAME_1,      "批处理文件"
  IDLANG_CHINESE + IDS_TOOL_FILTER_NAME_2,      "脚本文件"
  IDLANG_CHINESE + IDS_TOOL_FILTER_NAME_3,      "所有的文件"

  IDLANG_CHINESE + ID_MDI_MORE,                 "更多窗户......|选择一个窗口"
  IDLANG_CHINESE + ID_MDI_LIST,                 "窗口列表"

  IDLANG_CHINESE + IDS_DROP_CHECK_MTD,          "Method 检查"
  IDLANG_CHINESE + IDS_DROP_CHECK_MTD_REG,      "&Registers|检查寄存器用法到方法中"
  IDLANG_CHINESE + IDS_DROP_CHECK_MTD_ARG,      "&Arguments|检查参数用法到方法中"
  IDLANG_CHINESE + IDS_DROP_CHECK_MTD_LOC,      "&Locals|将本地用法检查到方法中"
  IDLANG_CHINESE + IDS_DROP_CHECK_MTD_ALL,      "所有|执行所有方法检查"
  IDLANG_CHINESE + IDS_DROP_CHECK_PRC,          "Procedure 检查"
  IDLANG_CHINESE + IDS_DROP_CHECK_PRC_REG,      "R&egisters|检查程序中的寄存器使用情况"
  IDLANG_CHINESE + IDS_DROP_CHECK_PRC_ARG,      "Ar&guments|检查过程参数的用法"
  IDLANG_CHINESE + IDS_DROP_CHECK_PRC_LOC,      "L&ocals|检查过程本地的使用情况"
  IDLANG_CHINESE + IDS_DROP_CHECK_PRC_ALL,      "所有|执行所有程序检查"
  IDLANG_CHINESE + IDS_DROP_CHECK_MAC,          "Macro 检查"
  IDLANG_CHINESE + IDS_DROP_CHECK_MAC_ARG,      "Arg&uments|检查宏参数的用法"
  IDLANG_CHINESE + IDS_DROP_CHECK_MAC_LOC,      "Lo&cals|检查宏本地的使用情况"
  IDLANG_CHINESE + IDS_DROP_CHECK_MAC_ALL,      "所有|执行所有宏检查"
END
